bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/std_drv/src/bl702l_sf_cfg.c
        /* Default is set, so return */
        if (flashPinCfg == SF_CTRL_SEL_INTERNAL_FLASH_SWAP_NONE) {
            return;
        }
    }

    if (flashPinCfg == SF_CTRL_SEL_EXTERNAL_FLASH) {
        SF_Cfg_Init_Ext_Flash_Gpio(0);
        SF_Ctrl_Select_Pad(SF_CTRL_PAD_SEL_SF2);
    } else {
        if (flashPinCfg == SF_CTRL_SEL_INTERNAL_FLASH_SWAP_NONE) {
            GLB_Set_Embedded_FLash_IO_PARM(0, 0, 0);
        } else if (flashPinCfg == SF_CTRL_SEL_INTERNAL_FLASH_SWAP_CSIO2) {
            GLB_Set_Embedded_FLash_IO_PARM(0, 0, 1);
        } else if (flashPinCfg == SF_CTRL_SEL_INTERNAL_FLASH_SWAP_IO0IO3) {
            GLB_Set_Embedded_FLash_IO_PARM(0, 1, 0);
        } else if (flashPinCfg == SF_CTRL_SEL_INTERNAL_FLASH_SWAP_BOTH) {
            GLB_Set_Embedded_FLash_IO_PARM(0, 1, 1);
        } else if (flashPinCfg == SF_CTRL_SEL_INTERNAL_FLASH_REVERSE_SWAP_NONE) {
            GLB_Set_Embedded_FLash_IO_PARM(1, 0, 0);
        } else if (flashPinCfg == SF_CTRL_SEL_INTERNAL_FLASH_REVERSE_SWAP_CSIO2) {
            GLB_Set_Embedded_FLash_IO_PARM(1, 0, 1);
        } else if (flashPinCfg == SF_CTRL_SEL_INTERNAL_FLASH_REVERSE_SWAP_IO0IO3) {
            GLB_Set_Embedded_FLash_IO_PARM(1, 1, 0);
        } else {
            GLB_Set_Embedded_FLash_IO_PARM(1, 1, 1);
        }

        SF_Cfg_Init_Internal_Flash_Gpio();
        SF_Ctrl_Select_Pad(SF_CTRL_PAD_SEL_SF1);
    }
}
#endif

/****************************************************************************/ /**
 * @brief  Identify one flash
 *
 * @param  callFromFlash: code run at flash or ram
 * @param  autoScan: Auto scan all GPIO pin
 * @param  flashPinCfg: Specify flash GPIO config, not auto scan
 * @param  restoreDefault: Wether restore default flash GPIO config
 * @param  pFlashCfg: Flash config pointer
 *
 * @return Flash ID
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
__WEAK
uint32_t ATTR_TCM_SECTION SF_Cfg_Flash_Identify(uint8_t callFromFlash,
                                                uint32_t autoScan, uint32_t flashPinCfg, uint8_t restoreDefault, SPI_Flash_Cfg_Type *pFlashCfg)
{
    uint32_t jdecId = 0;
    uint32_t i = 0;
    uint32_t offset;
    BL_Err_Type stat;

    BL702L_MemCpy_Fast(pFlashCfg, &flashCfg_Gd_Q80E_Q16E, sizeof(SPI_Flash_Cfg_Type));

    if (callFromFlash == 1) {
        stat = XIP_SFlash_State_Save(pFlashCfg, &offset);

        if (stat != SUCCESS) {
            SF_Ctrl_Set_Owner(SF_CTRL_OWNER_IAHB);
            return 0;
        }
    }

    if (autoScan) {
        flashPinCfg = 0;

        do {
            if (flashPinCfg > SF_CTRL_SEL_INTERNAL_FLASH_REVERSE_SWAP_BOTH) {
                jdecId = 0;
                break;
            }

            SF_Cfg_Init_Flash_Gpio(flashPinCfg, restoreDefault);
            SFlash_Releae_Powerdown(pFlashCfg);
            SFlash_Reset_Continue_Read(pFlashCfg);
            SFlash_DisableBurstWrap(pFlashCfg);
            jdecId = 0;
            SFlash_GetJedecId(pFlashCfg, (uint8_t *)&jdecId);
            SFlash_DisableBurstWrap(pFlashCfg);
            jdecId = jdecId & 0xffffff;
            flashPinCfg++;
        } while ((jdecId & 0x00ffff) == 0 || (jdecId & 0xffff00) == 0 || (jdecId & 0x00ffff) == 0xffff || (jdecId & 0xffff00) == 0xffff00);
    } else {
        /* select media gpio */
        SF_Cfg_Init_Flash_Gpio(flashPinCfg, restoreDefault);
        SFlash_Releae_Powerdown(pFlashCfg);
        SFlash_Reset_Continue_Read(pFlashCfg);
        SFlash_DisableBurstWrap(pFlashCfg);
        SFlash_GetJedecId(pFlashCfg, (uint8_t *)&jdecId);
        SFlash_DisableBurstWrap(pFlashCfg);
        jdecId = jdecId & 0xffffff;
    }

    for (i = 0; i < sizeof(flashInfos) / sizeof(flashInfos[0]); i++) {
        if (flashInfos[i].jedecID == jdecId) {
            BL702L_MemCpy_Fast(pFlashCfg, flashInfos[i].cfg, sizeof(SPI_Flash_Cfg_Type));
            break;
        }
    }

    if (i == sizeof(flashInfos) / sizeof(flashInfos[0])) {
        if (callFromFlash == 1) {
            XIP_SFlash_State_Restore(pFlashCfg, offset);
        }

        return jdecId;
    } else {
        if (callFromFlash == 1) {
            XIP_SFlash_State_Restore(pFlashCfg, offset);
        }

        return (jdecId | BFLB_FLASH_ID_VALID_FLAG);
    }
}
#endif

/****************************************************************************/ /**
 * @brief  Identify one flash patch
 *
 * @param  callFromFlash: code run at flash or ram
 * @param  autoScan: Auto scan all GPIO pin
 * @param  flashPinCfg: Specify flash GPIO config, not auto scan
 * @param  restoreDefault: Wether restore default flash GPIO config
 * @param  pFlashCfg: Flash config pointer
 *
 * @return Flash ID
 *
*******************************************************************************/
#ifndef BFLB_USE_ROM_DRIVER
uint32_t ATTR_TCM_SECTION SF_Cfg_Flash_Identify_Ext(uint8_t callFromFlash, uint32_t autoScan, uint32_t flashPinCfg,
                                                    uint8_t restoreDefault, SPI_Flash_Cfg_Type *pFlashCfg)
{
    return SF_Cfg_Flash_Identify(callFromFlash, autoScan, flashPinCfg, restoreDefault, pFlashCfg);
}
#endif

/*@} end of group SF_CFG_Public_Functions */

/*@} end of group SF_CFG */

/*@} end of group BL702L_Peripheral_Driver */
